<!DOCTYPE html>
<html lang="es">
	<head>
		<meta charset="UTF-8">
		<meta name="author" content="Gustavo Islas">
		<meta name="description" content="Desarrollador de Software Mainframe COBOL CICS DB2">
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<meta property="og:title" content="Desarrollador COBOL">
		<meta property="og:description" content="Desarrollador Mainframe COBOL CICS DB2">

		<title>
			&quot;Islas,&nbsp;Gustavo&nbsp;&mdash;&nbsp;Desarrollador&nbsp;de&nbsp;Software&nbsp;Mainframe&nbsp;COBOL&nbsp;CICS&nbsp;DB2&nbsp;&quot;
		</title>

		<script>
			function showGreeting()
				{
					var txt_first_name = document.getElementById("txt_first_name").value;
					var textContentParagraph = "¡Muchas Gracias " + txt_first_name + ", por su interés en contratar mi perfil profesional de Desarrollador de Software Mainframe COBOL!";

					alert(textContentParagraph);
				}
		</script>

		<style>
			body
				{
					font-family: Arial, sans-serif;
				}

			.meta-container
				{
					margin: auto;
					width: 100%;
				}
			
			.header
				{
					padding: 10px 0;
					text-align: center;
				}

			h1, h2
				{
					color: black;
				}

			.section
				{
					margin-bottom: 20px;
				}

			.section-title
				{
					border-bottom: 2px solid black;
					color: blue;
					font-size: 20px;
					font-weight: bold;
					margin-bottom: 20px;
				}

			.inline-table table
				{
					border-collapse: collapse;
					margin-bottom: 20px;
					width: 100%;
				}

			.inline-table th
				{
					background-color: Gainsboro;
					border: 1px solid Silver;
					padding: 8px;
				}

			.list-item
				{
					margin-bottom: 10px;
				}

			.nested-list
				{
					list-style: none;
				}

			footer
				{
					display: none;
					visibility: hidden;
				}
		</style>
	</head>

	<body>
		<div class="meta-container">
			<header>
				<div class="header">
					<h1>Gustavo&nbsp;Islas</h1>
					<h2>Desarrollador&nbsp;de&nbsp;Software&nbsp;Mainframe&nbsp;COBOL&nbsp;CICS&nbsp;DB2</h2>
				</div>

				<div class="section">
					<div class="inline-table">
						<table>
							<tr>
								<th title="Tel&eacute;fono m&oacute;vil">
									<a aria-label="Conversar por WhatsApp" href="https://wa.me/5519044356?text=Estoy%20interesado%20en%20contactarlo%20por%20su%20perfil%20profesional." title="N&uacute;mero telef&oacute;nico m&oacute;vil" target="_blank">
										(+52)&nbsp;55&nbsp;19&nbsp;04&nbsp;43&nbsp;56
									</a>
								</th>

								<th title="E-mail">
									<a href="mailto:gislasg78@gmail.com" title="Correo electr&oacute;nico personal">
										gislasg78@gmail.com
									</a>
								</th>

								<th title="LinkedIn">
									<a href="https://www.linkedin.com/in/gislasg78" title="Perfil profesional de LinkedIn" target="_blank">
										Perfil&nbsp;de&nbsp;LinkedIn
									</a>
								</th>

								<th title="Github">
									<a href="https://github.com/gislasg78" title="Repositorio de Github" target="_blank">
										Repositorio&nbsp;Github
									</a>
								</th>
							</tr>
						</table>
					</div>
				</div>
			</header>

			<main>
				<div class="section">
					<div class="section-title">
						Objetivo&nbsp;Profesional
					</div>

					<p>
						Soy un especialista experto <em>freelancer</em> con m&aacute;s de <i>veinte años</i> de experiencia en <b>COBOL</b>, <b>CICS</b>, <b>DB2</b>, <b>JCL</b>, <b>IMS</b>, y <b>MQ</b>, cuyo desempeño ha sido en el entorno <strong>Mainframe IBM OS/390 y z/OS MVS/VM</strong>, enfocado en el desarrollo de aplicaciones bajo <b>TSO</b>. Mi perfil abarca tanto procesos <strong>BATCH</strong> como <strong>ON-LINE</strong>, con experticia en modos <em>conversacionales</em> y <em>pseudoconversacionales</em> (transaccionales) y emulaci&oacute;n de terminales <b>IBM 3270</b>. He participado en proyectos de migraci&oacute;n de datos cuyos resultados han reducido costos operativos y han mejorado su eficiencia. Actualmente, busco una oportunidad <strong>100%</strong> <i>remota</i> para seguir aprendiendo y aportar valor en empresas innovadoras de los sectores de <i>banca</i>, <i>finanzas</i> y <i>seguros</i>, comprometidas con la calidad de sus servicios en <b>TI</b>.
					</p>
				</div>

				<div class="section">
					<div class="section-title">
						Proyectos&nbsp;Estrat&eacute;gicos
					</div>

					<ul>
						<li>Activos,&nbsp;arrendamiento&nbsp;financiero,&nbsp;archivos de movimientos, maestros y de transacciones,&nbsp;autofinanciamientos,&nbsp;banca&nbsp;electr&oacute;nica,&nbsp;comisiones,&nbsp;contabilidad financiera,&nbsp;cuentas por cobrar,&nbsp;detecci&oacute;n de fraudes,&nbsp;divisas,&nbsp;domiciliaciones,&nbsp;estados de cuenta,&nbsp;fideicomisos,&nbsp;flujos operativos,&nbsp;hipotecario,&nbsp;ingenier&iacute;a inversa,&nbsp;liquidaciones,&nbsp;marcas &oacute;pticas,&nbsp;medios de pago,&nbsp;pagar&eacute;s,&nbsp;pagos de servicios (<b>SPEI</b>),&nbsp;plantillas contables,&nbsp;pr&eacute;stamos,&nbsp;retenciones,&nbsp;tipos de cambio y transferencias (<i>nacionales</i> e <i>internacionales</i>).</li>
					</ul>
				</div>

				<div class="section">
					<div class="section-title">
						Portafolio&nbsp;de&nbsp;Trayectoria&nbsp;Profesional
					</div>

					<div class="list-item">
						<section>
							<h3>Desarrollador&nbsp;de&nbsp;Software&nbsp;Financiero&nbsp;Freelancer&nbsp;Mainframe&nbsp;&#124;&nbsp;Fiverr Independent Projects for Systems&nbsp;&#124;&nbsp;Enero 2017&nbsp;&mdash;&nbsp;Actualidad</h3>
							<ul>
								<li><b>An&aacute;lisis y Diseño.</b></li>
								<li class="nested-list">
									<ul>
										<li>Desarrollar y mantener sistemas de gesti&oacute;n de datos utilizando <b>COBOL</b> y <b>DB2</b>, mejorando la funcionalidad y el rendimiento del sistema.</li>
										<li>Realizar an&aacute;lisis y diseño de soluciones eficientes y efectivas para mejorar la funcionalidad y el rendimiento del sistema.</li>
									</ul>
								</li>

								<li><b>Colaboraci&oacute;n y Capacitaci&oacute;n.</b></li>
								<li class="nested-list">
									<ul>
										<li>Capacitar a usuarios y nuevos desarrolladores en el uso y mantenimiento de las aplicaciones desarrolladas.</li>
										<li>Colaborar con equipos interdisciplinarios para la mejora adaptativa de los sistemas.</li>
									</ul>
								</li>

								<li><b>Desarrollo de Aplicaciones.</b></li>
								<li class="nested-list">
									<ul>
										<li>Diseñar, desarrollar y mantener aplicaciones utilizando <b>COBOL</b>, <b>CICS</b>, <b>DB2</b>, <b>JCL</b>, <b>IMS</b> y <b>MQ</b>.</li>
										<li>Participar en proyectos de migraci&oacute;n de datos, logrando reducir costos operativos y mejorar la eficiencia.</li>
									</ul>
								</li>

								<li><b>Enfoque en Calidad y Satisfacci&oacute;n del Cliente.</b></li>
								<li class="nested-list">
									<ul>
										<li>Garantizar la calidad del software mediante pr&aacute;cticas de desarrollo rigurosas.</li>
										<li>Orientarse a la satisfacci&oacute;n del cliente, asegurando que las soluciones desarrolladas cumplan con los requisitos y expectativas del negocio.</li>
									</ul>
								</li>

								<li><b>Metodolog&iacute;as &Aacute;giles y Control de Versiones.</b></li>
								<li class="nested-list">
									<ul>
										<li>Intervenir en ciclos de desarrollo &aacute;gil, contribuyendo a la mejora continua del proceso de desarrollo.</li>
										<li>Trabajar con metodolog&iacute;as &aacute;giles y herramientas de control de versiones para asegurar la calidad del desarrollo.</li>
									</ul>
								</li>
							</ul>
						</section>

						<section>
							<h3>Consultor&nbsp;Senior&nbsp;COBOL&nbsp;CICS&nbsp;DB2&nbsp;&#124;&nbsp;Procuradur&iacute;a&nbsp;General&nbsp;de&nbsp;Justicia&nbsp;del&nbsp;Distrito&nbsp;Federal &#124; Mayo 2016 &mdash; Noviembre 2016</h3>
							<ul>
								<li><b>An&aacute;lisis y Asesor&iacute;a T&eacute;cnica.</b></li>
								<li class="nested-list">
									<ul>
										<li>Apoyar en la canalizaci&oacute;n de solicitudes y problemas t&eacute;cnicos a las instancias correspondientes para su resoluci&oacute;n.</li>
										<li>Realizar an&aacute;lisis detallados de los requisitos y necesidades del sistema, proporcionando asesor&iacute;a t&eacute;cnica y jur&iacute;dica sobre los derechos y regulaciones aplicables.</li>
									</ul>
								</li>

								<li><b>Atenci&oacute;n y Soporte a Usuarios.</b></li>
								<li class="nested-list">
									<ul>
										<li>Brindar apoyo t&eacute;cnico a los usuarios de los sistemas mainframe, incluyendo asesor&iacute;a y orientaci&oacute;n sobre el uso de las aplicaciones.</li>
										<li>Proveer soporte en la resoluci&oacute;n de problemas y en la implementaci&oacute;n de soluciones t&eacute;cnicas que beneficien a los usuarios finales.</li>
									</ul>
								</li>

								<li><b>Desarrollo y Mantenimiento de Aplicaciones.</b></li>
								<li class="nested-list">
									<ul>
										<li>Diseñar, desarrollar y mantener aplicaciones <b>COBOL</b>, asegurando la calidad del c&oacute;digo y la eficiencia del sistema.</li>
										<li>Implementar mejoras y nuevas funcionalidades en las aplicaciones existentes para satisfacer las necesidades cambiantes de la organizaci&oacute;n.</li>
									</ul>
								</li>

								<li><b>Detecci&oacute;n y Prevenci&oacute;n de Problemas.</b></li>
								<li class="nested-list">
									<ul>
										<li>Apoyar en la prevenci&oacute;n de conductas violentas, antisociales y delictivas mediante el desarrollo de sistemas que promuevan la seguridad y la justicia.</li>
										<li>Detectar y analizar problem&aacute;ticas en la comunidad de usuarios en funci&oacute;n a la procuraci&oacute;n de justicia, proponiendo alternativas de soluci&oacute;n y mejoras en los sistemas.</li>
									</ul>
								</li>

								<li><b>Educaci&oacute;n y Capacitaci&oacute;n.</b></li>
								<li class="nested-list">
									<ul>
										<li>Desarrollar y proporcionar pl&aacute;ticas, cursos y seminarios sobre el uso y mantenimiento de las aplicaciones mainframe.</li>
										<li>Participar en la capacitaci&oacute;n de nuevos desarrolladores y en la actualizaci&oacute;n de conocimientos del equipo t&eacute;cnico.</li>
									</ul>
								</li>

								<li><b>Estudios y An&aacute;lisis Sociol&oacute;gicos.</b></li>
								<li class="nested-list">
									<ul>
										<li>Apoyar en el estudio de casos seriales de v&iacute;ctimas de delitos sexuales para mejorar la respuesta del sistema judicial.</li>
										<li>Colaborar en la realizaci&oacute;n de estudios sociol&oacute;gicos del fen&oacute;meno de la ausencia y extrav&iacute;o, estableciendo los factores que inciden en la problem&aacute;tica.</li>
									</ul>
								</li>

								<li><b>Gesti&oacute;n de Datos y Control de Registros.</b></li>
								<li class="nested-list">
									<ul>
										<li>Asegurar la integridad y confidencialidad de los datos manejados por las aplicaciones de mainframe.</li>
										<li>Mantener el control y registro de los fondos revolventes y otros recursos asignados a los proyectos de desarrollo.</li>
									</ul>
								</li>

								<li><b>Mejora Continua y Calidad de Servicios.</b></li>
								<li class="nested-list">
									<ul>
										<li>Analizar y desarrollar componentes <b>COBOL</b> para mejorar la calidad y eficiencia de las aplicaciones utilizadas en las <i>Fiscal&iacute;as</i>, <i>Centros de Atenci&oacute;n a V&iacute;ctimas</i> y dem&aacute;s &aacute;reas.</li>
										<li>Identificar y resolver problemas t&eacute;cnicos y funcionales en las aplicaciones de mainframe para garantizar un servicio &oacute;ptimo.</li>
									</ul>
								</li>

								<li><b>Propuestas de Mejora.</b></li>
								<li class="nested-list">
									<ul>
										<li>Proponer alternativas de soluci&oacute;n a las problem&aacute;ticas t&eacute;cnicas y funcionales planteadas, enfoc&aacute;ndose en la mejora continua y la innovaci&oacute;n en los sistemas mainframe.</li>
									</ul>
								</li>
							</ul>
						</section>

						<section>
							<h3>T&eacute;cnico Administrativo&nbsp;&mdash;&nbsp;Desarrollador de Software COBOL&nbsp;&#124;&nbsp;Consejo de la Judicatura Federal&nbsp;&#124;&nbsp;Mayo 2007&nbsp;&mdash;&nbsp;Abril 2016</h3>
							<ul>
								<li><b>An&aacute;lisis de Riesgos y Seguridad.</b></li>
								<li class="nested-list">
									<ul>
										<li>Asegurar que las aplicaciones desarrolladas cumplan con los est&aacute;ndares de seguridad y protecci&oacute;n de datos.</li>
										<li>Participar en el <b>An&aacute;lisis de riesgos</b> y contribuir a la creaci&oacute;n de dict&aacute;menes sistematizados de seguridad y vigilancia.</li>
									</ul>
								</li>

								<li><b>Colaboraci&oacute;n en Programas Nacionales.</b></li>
								<li class="nested-list">
									<ul>
										<li>Contribuir al &eacute;xito del <b>Programa Nacional de Enlaces Regionales</b> mediante el desarrollo de sistemas que faciliten la comunicaci&oacute;n y coordinaci&oacute;n entre regiones.</li>
										<li>Participar en el <b>Programa de Visitas a Inmuebles Centrales</b>, proporcionando soluciones tecnol&oacute;gicas que mejoren la log&iacute;stica y la gesti&oacute;n de estas visitas.</li>
									</ul>
								</li>

								<li><b>Desarrollo y Mantenimiento de Sistemas Integrales.</b></li>
								<li class="nested-list">
									<ul>
										<li>Desarrollar y mantener el <b>Sistema Integral Financiero</b>, asegurando su robustez y eficiencia.</li>
										<li>Realizar mantenimiento corporativo al <b>Sistema Integral de Administraci&oacute;n de Vi&aacute;ticos</b> y al <b>Sistema Integral de Gesti&oacute;n Administrativa</b> para garantizar su correcto funcionamiento y actualizaci&oacute;n continua.</li>
									</ul>
								</li>

								<li><b>Optimizaci&oacute;n de Procesos.</b></li>
								<li class="nested-list">
									<ul>
										<li>Identificar oportunidades de mejora en los sistemas existentes y proponer soluciones innovadoras para optimizar procesos administrativos y financieros.</li>
										<li>Implementar mejoras continuas en los <i>sistemas integrales</i>, asegurando su adaptabilidad a las necesidades cambiantes de la dependencia gubernamental.</li>
									</ul>
								</li>

								<li><b>Programas de Protecci&oacute;n y Gesti&oacute;n.</b></li>
								<li class="nested-list">
									<ul>
										<li>Apoyar en el desarrollo y ejecuci&oacute;n de <b>Programas Internos de Protecci&oacute;n Civil</b>, implementando funcionalidades que mejoren la respuesta ante emergencias.</li>
										<li>Desarrollar y optimizar aplicaciones para el <b>Programa de Gesti&oacute;n de Vi&aacute;ticos y Gastos de Representaci&oacute;n</b>, facilitando la administraci&oacute;n eficiente de recursos.</li>
									</ul>
								</li>

								<li><b>Soporte y Capacitaci&oacute;n.</b></li>
								<li class="nested-list">
									<ul>
										<li>Capacitar a los usuarios y al personal t&eacute;cnico en el uso y mantenimiento de los sistemas desarrollados, asegurando una correcta adopci&oacute;n de las nuevas funcionalidades.</li>
										<li>Proveer <b>soporte&nbsp;t&eacute;cnico</b> a los usuarios de los sistemas <b>mainframe</b>, resolviendo problemas y atendiendo consultas relacionadas con sus aplicaciones.</li>
									</ul>
								</li>
							</ul>
						</section>

						<section>
							<h3>Desarrollador&nbsp;COBOL &#124; Grupo&nbsp;Financiero&nbsp;BBVA&nbsp;Bancomer &#124; Enero 1997 &mdash; Abril 2007 </h3>
							<ul>
								<li><b>An&aacute;lisis de Riesgos y Seguimiento.</b></li>
								<li class="nested-list">
									<ul>
										<li>Participar en el Proyecto Año <b>2000</b>, gestionando riesgos crediticios y asegurando la integraci&oacute;n y funcionalidad de los sistemas.</li>
										<li>Realizar seguimiento comercial y capacitaci&oacute;n a becarios, promoviendo el desarrollo profesional y el &eacute;xito de los proyectos.</li>
									</ul>
								</li>

								<li><b>An&aacute;lisis y Soluci&oacute;n de Problemas.</b></li>
								<li class="nested-list">
									<ul>
										<li>Analizar componentes <b>COBOL</b> para proyectos clave, asegurando la calidad y eficiencia de las soluciones implementadas.</li>
										<li>Resolver problemas y brindar soporte t&eacute;cnico a usuarios finales, asegurando la continuidad operativa de los sistemas.</li>
									</ul>
								</li>

								<li><b>Capacitaci&oacute;n y Colaboraci&oacute;n.</b></li>
								<li class="nested-list">
									<ul>
										<li>Capacitar a usuarios y nuevos desarrolladores, asegurando una correcta adopci&oacute;n y uso de los sistemas.</li>
										<li>Colaborar con equipos interdisciplinarios en la mejora adaptativa de los sistemas, promoviendo la integraci&oacute;n de soluciones tecnol&oacute;gicas financieras.</li>
									</ul>
								</li>

								<li><b>Desarrollo y Mantenimiento de Aplicaciones.</b></li>
								<li class="nested-list">
									<ul>
										<li>Desarrollar, mantener y brindar soporte a aplicaciones <b>COBOL</b> en entornos Mainframe para el sector financiero, incluyendo <b>Estados de Cuenta</b>, <b>Marcas &oacute;pticas</b>, <b>Liquidaciones</b> y <b>Retenciones</b>.</li>
										<li>Implementar soluciones para sistemas financieros y bancarios, asegurando su integraci&oacute;n y funcionalidad continua.</li>
									</ul>
								</li>

								<li><b>Gesti&oacute;n de Proyectos y Documentaci&oacute;n.</b></li>
								<li class="nested-list">
									<ul>
										<li>Documentar proyectos estrat&eacute;gicos de negocios, asegurando la claridad y accesibilidad de la informaci&oacute;n t&eacute;cnica.</li>
										<li>Gestionar proyectos de implementaci&oacute;n en <b>Mainframe</b>, cumpliendo con los objetivos estrat&eacute;gicos y asegurando el monitoreo de las fases de <b>Test</b>&mdash;<b>Implantaci&oacute;n</b>&mdash;<b>Producci&oacute;n&nbsp;</b>y&nbsp;<b>Telem&aacute;tico</b>.</li>
									</ul>
								</li>

								<li><b>Gesti&oacute;n y Optimizaci&oacute;n de Sistemas.</b></li>
								<li class="nested-list">
									<ul>
										<li>Actualizar sistemas legales y asegurar su conformidad con las normativas vigentes, como <b>IMSS/INFONAVIT</b>.</li>
										<li>Gestionar proyectos de migraci&oacute;n y consolidaci&oacute;n de sistemas legados a nuevas plataformas cr&iacute;ticas, reduciendo costos operativos en un <b>20%</b>.</li>
										<li>Optimizar procesos <b>batch</b> y <b>en&nbsp;l&iacute;nea</b>, mejorando la eficiencia de los sistemas embebidos en un <b>30%</b> y reduciendo los tiempos de ejecuci&oacute;n de los sistemas transaccionales en un <b>25%</b>.</li>
									</ul>
								</li>

								<li><b>Integraci&oacute;n y Consolidaci&oacute;n de Informaci&oacute;n Financiera.</b></li>
								<li class="nested-list">
									<ul>
										<li>Desarrollar soluciones de integraci&oacute;n para sistemas de datos heterog&eacute;neos, asegurando la consolidaci&oacute;n de informaci&oacute;n financiera trascendental.</li>
										<li>Implementar un sistema de procesamiento de transacciones de primer nivel, mejorando su eficiencia en un <b>30%</b>.</li>
									</ul>
								</li>
							</ul>
						</section>
					</div>
				</div>

				<div class="section">
					<div class="section-title">
						Credenciales&nbsp;Acad&eacute;micas
					</div>

					<div class="list-item">
						<ul>
							<li><b>Bachillerato&nbsp;Tecnol&oacute;gico&nbsp;en&nbsp;Administraci&oacute;n.</b></li>
							<li class="nested-list">
								<ul>
									<li>Centro&nbsp;de&nbsp;Estudios&nbsp;Tecnol&oacute;gicos,&nbsp;Industrial&nbsp;y&nbsp;de&nbsp;Servicios&nbsp;No.&nbsp;56.</li>
									<li><strong>Febrero&nbsp;1999 &mdash; Junio&nbsp;2001.</strong></li>
								</ul>
							</li>

							<li><b>T&eacute;cnico&nbsp;Profesional&nbsp;en&nbsp;Programaci&oacute;n.</b></li>
							<li class="nested-list">
								<ul>
									<li>Centro&nbsp;de&nbsp;Estudios&nbsp;Tecnol&oacute;gicos,&nbsp;Industrial&nbsp;y&nbsp;de&nbsp;Servicios&nbsp;No.&nbsp;3.</li>
									<li><strong>Septiembre&nbsp;1993 &mdash; Junio&nbsp;1996.</strong></li>
								</ul>
							</li>
						</ul>
					</div>
				</div>

				<div class="section">
					<div class="section-title">
						Habilidades
					</div>

					<table>
						<tr>
							<th>Blandas</th>
							<td>
								<ul>
									<li>Comunicaci&oacute;n efectiva.</li>
									<li>Gesti&oacute;n del tiempo.</li>
									<li>Pensamiento cr&iacute;tico.</li>
									<li>Resoluci&oacute;n de problemas.</li>
									<li>Trabajo en equipo.</li>
								</ul>
							</td>

							<th>T&eacute;cnicas</th>
							<td>
								<ul>
									<li>Bases de datos: <b>DB2</b>, <b>IMS</b>.</li>
									<li>Conocimiento de sistemas financieros y bancarios.</li>
									<li>Enfoque a resultados.</li>
									<li>Entornos Mainframe: <b>IBM</b>&nbsp;<b>OS/390</b> & <b>z/OS</b>, <b>MVS/VM</b>.</li>
									<li>Lenguajes de programaci&oacute;n: <b>COBOL</b>, <b>CICS</b>, <b>JCL</b>.</li>
									<li>Habilidades anal&iacute;ticas.</li>
									<li>Herramientas de desarrollo: <b>TSO</b>/<b>ISPF</b>, <b>CICS</b>.</li>
									<li>Trabajo en equipo.</li>
								</ul>
							</td>
						</tr>
					</table>
				</div>

				<div class="section">
					<div class="section-title">
						Competencias&nbsp;laborales
					</div>

					<div class="list-item">
						<ul>
							<li><b>CICS.</b></li>
							<li class="nested-list">
								<ul>
									<li><b><i>Control de transacciones.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>Bases de datos <b>DL/1</b> y <b>DB2</b>.&nbsp;<b>BMS</b> (Mapas de operaciones de entrada y salida).&nbsp;Control de:&nbsp;Almacenamiento temporal.&nbsp;Archivos (acceso aleatorio y secuencial).&nbsp;Datos transitorios.&nbsp;Tareas e intervalos de control.&nbsp;Terminales&nbsp;(<b>VSAM</b>/<b>ESDS</b>/<b>RRDS</b>).&nbsp;Programas de aplicaci&oacute;n para control de programas.&nbsp;Pruebas y depuraci&oacute;n de programas e intercomunicaciones.&nbsp;Seguridad, recuperaci&oacute;n y restablecimiento del sistema.</li>
										</ul>
									</li>

									<li><b><i>Conversacional &amp; Transaccional.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>BMS,&nbsp;CEBR,&nbsp;CECI,&nbsp;CEDA,&nbsp;CEDC,&nbsp;CEDF,&nbsp;CEMT,&nbsp;CESF,&nbsp;CMAC,&nbsp;SYSPLEX.</li>
										</ul>
									</li>
								</ul>
							</li>

							<li><b>COBOL.</b></li>
							<li class="nested-list">
								<ul>
									<li><b><i>Programaci&oacute;n.</i></b></li>
									<li class="nested-list">
										<ul>
											<li><b><i>Condiciones e instrucciones condicionales:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Anidadas. Complejas. Con nombres de condici&oacute;n. De clase. De relaci&oacute;n. De signo. Para verificar datos de entrada.</li>
												</ul>
											</li>

											<li><b><i>Conjuntos elementales de instrucciones:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Estructuras: <i>alternativas</i>, <i>condicionales</i>, <i>secuenciales</i> y <i>repetitivas</i>. Verbos: aritm&eacute;ticos, de control, de entrada-salida, de transferencia. Depuraci&oacute;n y prueba de programas.</li>
												</ul>
											</li>

											<li><b><i>Diseño de programas:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Caja negra para m&oacute;dulos cohesivos. Diseño de programas con l&oacute;gica para control de ruptura. Niveles de abstracci&oacute;n. Particiones. Reglas de los formatos para programas.</li>
												</ul>
											</li>

											<li><b><i>Estructuraci&oacute;n de programas:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Diagramas: de bloque, de estructura o jer&aacute;rquicos, de flujo y l&oacute;gica, de sintaxis. Programaci&oacute;n Estructurada. Seudoc&oacute;digo.</li>
												</ul>
											</li>

											<li><b><i>Manejo avanzado del lenguaje:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Calificaci&oacute;n. Registros de datos m&uacute;ltiples. Modificaci&oacute;n de referencia.</li>
												</ul>
											</li>

											<li><b><i>Manejo de definiciones de datos:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Conformaci&oacute;n de registros. Descripciones y ediciones de datos. Estructuraci&oacute;n y relaciones. Nombres de condici&oacute;n.</li>
												</ul>
											</li>

											<li><b><i>Manejo de procedimientos:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Archivos de entrada y salida. Formatos de codificaci&oacute;n del lenguaje <strong>COBOL</strong>. Transferencia de datos.</li>
												</ul>
											</li>

											<li><b><i>Manejo de tablas:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>B&uacute;squeda en tablas. Entradas de valores constantes. Lectura de valores de las tablas. Ordenamientos internos: <em>algoritmos de comparaci&oacute;n de intercambio de elementos adyacentes</em>. Tablas bidimensionales y de dimensi&oacute;n superior. Subíndices.</li>
												</ul>
											</li>

											<li><b><i>Procesamiento de archivos:</i></b></li>
											<li class="nested-list">
												<ul>
													<li><em>Relativos:</em></li>

													<li class="nested-list">
														<ul>
															<li>Creaci&oacute;n y actualizaci&oacute;n. M&eacute;todos de aleatorizaci&oacute;n, <em>hashing</em> o de transformaci&oacute;n clave en direcci&oacute;n relativa: <i>an&aacute;lisis de dígitos</i>, <i>de equivalentes alfab&eacute;ticos a c&oacute;digos num&eacute;ricos</i>, <i>del residuo</i>, <i>plegamiento</i> y <i>semicuadrados</i>. Organizaci&oacute;n.</li>
														</ul>
													</li>
												</ul>
											</li>

											<li class="nested-list">
												<ul>
													<li><em>Secuenciales:</em></li>

													<li class="nested-list">
														<ul>
															<li>Creaci&oacute;n y actualizaci&oacute;n. Entradas de descripci&oacute;n de archivos. Organizaci&oacute;n y almacenamiento. Ordenamiento e intercalaci&oacute;n de archivos secuenciales. R&oacute;tulos.</li>
														</ul>
													</li>
												</ul>
											</li>

											<li class="nested-list">
												<ul>
													<li><em>Secuenciales con &iacute;ndice:</em></li>

													<li class="nested-list">
														<ul>
															<li>Creaci&oacute;n y actualización. Organizaci&oacute;n.</li>
														</ul>
													</li>
												</ul>
											</li>

											<li><b><i>Programaci&oacute;n avanzada COBOL:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Caracteres y palabras. Constantes. Ejecuci&oacute;n. Esquematizaci&oacute;n. Estructuraci&oacute;n. Forma de codificaci&oacute;n <strong>COBOL</strong>. Nombres de datos.</li>
												</ul>
											</li>

											<li><b><i>Subprogramas y programas anidados:</i></b></li>
											<li class="nested-list">
												<ul>
													<li>Programas que llaman y son llamados. Programas <strong>COBOL</strong> anidados.</li>
												</ul>
											</li>
										</ul>
									</li>

									<li><b><i>Versiones.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>(ANS X3.23-1974 & X3.23-1985)&nbsp;/&nbsp;(MicroFocus COBOL/2 VS COBOL, FILESHARE, ANIMATOR, LEVEL II COBOL, LEVEL III COBOL/ET, Professional COBOL).</li>
										</ul>
									</li>
								</ul>
							</li>

							<li><b>DB2/SQL.</b></li>
							<li class="nested-list">
								<ul>
									<li><b><i>DCL. Data Control Language.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>GRANT & REVOKE.</li>
										</ul>
									</li>

									<li><b><i>DDL. Data Definition Language.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>ALTER (RENAME, CHANGE, ADD COLUMN, DROP...). CREATE (bases de datos, usuarios, tablas...), tablas de enlace. DROP (bases de datos y tablas), consistencia e integridad.</li>
										</ul>
									</li>

									<li><b><i>DML. Data Manipulation Language.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>DELETE, INSERT, SELECT, UPDATE. Ordenamiento, agregaci&oacute;n, agrupamiento y uniones.</li>
										</ul>
									</li>
								</ul>
							</li>

							<li><b>Metodolog&iacute;as.</b></li>
							<li class="nested-list">
								<ul>
									<li><b>&Aacute;giles.</b></li>
									<li class="nested-list">
										<ul>
											<li>JIRA,&nbsp;KANBAN,&nbsp;SCRUM.</li>
										</ul>
									</li>

									<li><b>Metodolog&iacute;as&nbsp;de&nbsp;documentaci&oacute;n.</b>&nbsp;</li>
									<li class="nested-list">
										<ul>
											<li>BPMN,&nbsp;EBNF,&nbsp;HIPO,&nbsp;OTIDA,&nbsp;SCRUM,&nbsp;TOP-DOWN,&nbsp;UML/OMG,&nbsp;WARNIER.</li>
										</ul>
									</li>

									<li><b>Programaci&oacute;n estructurada.</b></li>
									<li class="nested-list">
										<ul>
											<li>&nbsp;CHAPIN,&nbsp;JACKSON,&nbsp;TABOURIER.</li>
										</ul>
									</li>
								</ul>
							</li>

							<li><b>TSO&nbsp;para&nbsp;desarrolladores.</b></li>
							<li class="nested-list">
								<ul>
									<li><b><i>Procesamiento por lotes.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>Abend&mdash;Aid,&nbsp;ALTAIR,&nbsp;ALTAMIRA,&nbsp;CHANGE MAN,&nbsp;CLIST,&nbsp;CTRL+D,&nbsp;CTRL+M,&nbsp;CTRL+R,&nbsp;ENDEAVOR,&nbsp;FILE&mdash;AID,&nbsp;IAM&nbsp;Files,&nbsp;ISPF,&nbsp;JES,&nbsp;JCL,&nbsp;MQ,&nbsp;MVS,&nbsp;Omegamon,&nbsp;QMF,&nbsp;SDSF,&nbsp;SMART TEST,&nbsp;SPUFI,&nbsp;VSAM,&nbsp;XPEDITER&nbsp;(<i>batch&nbsp;debbuger</i>).</li>
										</ul>
									</li>

									<li><b><i>Utilidades.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>IEBCOMPR, IEBCOPY, IEFBR14, IEBGENER, IEHINITT, IEHLIST, IEHPROGM, IEBPTPCH, IEBUPDATE.</li>
										</ul>
									</li>

									<li><b><i>Especiales.</i></b></li>
									<li class="nested-list">
										<ul>
											<li>IDCAMS, IEKFJ01, SORT.</li>
										</ul>
									</li>
								</ul>
							</li>
						</ul>
					</div>
				</div>
			</main>

			<footer>
				<form>
					<fieldset>
						<legend title="Comunicarse conmigo">Contactarme</legend>
						<label for="txt_first_name" title="Proporcione su nombre completo">Nombre:&nbsp;</label>
						<input type="text" id="txt_first_name" placeholder="Ingrese su nombre" title="Introduzca su nombre" required>
						<button onclick="showGreeting()" title="Presione aqu&iacute; si requiere contactarme">Saludar</button>
					</fieldset>
				</form>
			</footer>
		</div>
	</body>
</html>
